[
{"download_latency": 0.2433624267578125, "download_timeout": 180.0, "director": "Francis Ford Coppola", "synopsis": "Epic tale of a 1940s New York Mafia family and their struggle to protect their empire from rival families as the leadership switches from the father (Marlon Brando) to his youngest son (Al Pacino). Vito Corleone (Marlon Brando) is The Godfather, the Don (head) of a successful, tightly-knit family whose business is organized crime. Heir apparent is impulsive, hot-tempered Sonny (James Caan), whose brothers are brooding Michael (Al Pacino), who tries to seperate himself from his criminal family, and Fredo (John Cazale), who can't seem to do anything right. Vito has also adopted level-headed Tom Hagan (Robert Duvall), now the family lawyer. Vito's refusal to enter the lucrative drug rackets puts him in a war between the mafia families. Michael gets his hand dirty by taking revenge on the family's behalf, and then taking over as the new calculating, ruthless godfather. In his new role he plots to make the Corleones the leading players in Las Vegas casino industry while arranging for the war in New York City to be settled for once and for all. ", "download_slot": "www.filmaffinity.com", "mark": "9.0", "depth": 1, "country": "United States", "title": "The Godfather", "duration": "175 min.", "cast": "Marlon Brando Al Pacino James Caan Robert Duvall Diane Keaton John Cazale Talia Shire Richard S. Castellano Sterling Hayden Gianni Russo Rudy Bond John Marley Richard Conte Al Lettieri Abe Vigoda Franco Citti Lenny Montana Al Martino Joe Spinell Simonetta Stefanelli Morgana King Alex Rocco John Martino Salvatore Corsitto", "genre": "Drama", "year": "1972", "url": "https://www.filmaffinity.com/en/film809297.html"},
{"download_latency": 1.2404892444610596, "download_timeout": 180.0, "director": "Steven Spielberg", "synopsis": "Oskar Schindler is a German businessman in Poland who sees an opportunity to make money from the Nazis' rise to power. He starts a company to make cookware and utensils, using flattery and bribes to win military contracts, and brings in accountant and financier Itzhak Stern (Ben Kingsley) to help run the factory. By staffing his plant with Jews who've been herded into Krakow's ghetto by Nazi troops, Schindler has a dependable unpaid labor force. For Stern, a job in a war-related plant could mean survival for himself and the other Jews working for Schindler. However, in 1942, all of Krakow's Jews are assigned to the Plaszow Forced Labor Camp, overseen by Commandant Amon Goeth (Ralph Fiennes), an embittered alcoholic who occasionally shoots prisoners from his balcony. Schindler arranges to continue using Polish Jews in his plant, but, as he sees what is happening to his employees, he begins to develop a conscience. He realizes that his factory (now refitted to manufacture ammunition) is the only thing preventing his staff from being shipped to the death camps. Soon Schindler demands more workers and starts bribing Nazi leaders to keep Jews on his employee lists and out of the camps. By the time Germany falls to the allies, Schindler has lost his entire fortune — and saved 1,100 people from likely death.", "download_slot": "www.filmaffinity.com", "mark": "8.7", "depth": 1, "country": "United States", "title": "Schindler's List ", "duration": "195 min.", "cast": "Liam Neeson Ben Kingsley Ralph Fiennes Caroline Goodall Jonathan Sagall Embeth Davidtz Norbert Weisser Martin S. Bergmann Mark Ivanir Malgorzata Gebel Shmuel Levy Michael Schneider Joachim Paul Assböck Branko Lustig Götz Otto", "genre": "Drama", "year": "1993", "url": "https://www.filmaffinity.com/en/film656153.html"},
{"download_latency": 1.483391284942627, "download_timeout": 180.0, "director": "Charles Chaplin", "synopsis": "Chaplin is a factory worker in this hectic age - a minor cog in the grinding wheels of industry. His job -mechanically tightening bolts on a moving belt. The monotony of the work drives him beserk. Taken to hospital he soon recovers and is discharged, cautioned to avoid excitement. Caught in a street riot, he is mistaken for the leader and thrown into a patrol wagon. Charlie unconsciously thwarts an attempted jailbreak. As a reward he is given a cell with all the comforts of home. But just as he is ready to settle down to a life of ease and contentment in jail, he is pardoned. He then gets a job in a shipyard, but is fired for doing the wrong things at the wrong times. He resolves to return to the comfort and security of jail. He meets the girl - a gamine of the waterfront. She and her orphaned sisters are about to be taken into custody by the juvenile welfare officers, but she escapes. When she is about to be arrested for stealing food, Charlie attempts to take the blame, without success. He wanders into a cafeteria, orders everything in sight, then informs the manager that he has no money to pay. On the way to jail he meets the girl again. Together they escape and from then on they are inseparable companions.", "download_slot": "www.filmaffinity.com", "mark": "8.6", "depth": 1, "country": "United States", "title": "Modern Times", "duration": "89 min.", "cast": "Charles Chaplin Paulette Goddard Henry Bergman Chester Conklin Stanley Stanford Hank Mann Louis Natheaux Allan Garcia", "genre": "Comedy", "year": "1936", "url": "https://www.filmaffinity.com/en/film726746.html"},
{"download_latency": 1.4896018505096436, "download_timeout": 180.0, "director": "Quentin Tarantino", "synopsis": "The film interweaves three tales: the first story focuses on Vincent Vega (John Travolta) and Jules Winnfield (Samuel L. Jackson), two hit men on duty for \"the big boss,\" Marsellus Wallace (Ving Rhames), whose gorgeous wife, Mia (Uma Thurman), takes a liking to Vincent. In the second, a down-and-out pugilist (Bruce Willis), who is ordered to take a fall, decides that there’s more money in doing the opposite. The final chapter follows a pair of lovers (Amanda Plummer and Tim Roth) as they prepare to hold up a diner.", "download_slot": "www.filmaffinity.com", "mark": "8.6", "depth": 1, "country": "United States", "title": "Pulp Fiction", "duration": "153 min.", "cast": "John Travolta Samuel L. Jackson Uma Thurman Bruce Willis Ving Rhames Harvey Keitel Tim Roth Amanda Plummer María de Medeiros Eric Stoltz Rosanna Arquette Christopher Walken Paul Calderon Bronagh Gallagher Peter Greene Stephen Hibbert Angela Jones Phil LaMarr Robert Ruth Julia Sweeney Quentin Tarantino Frank Whaley Duane Whitaker Steve Buscemi Burr Steers", "genre": "Thriller", "year": "1994", "url": "https://www.filmaffinity.com/en/film160882.html"},
{"download_latency": 1.5186564922332764, "download_timeout": 180.0, "director": "George Roy Hill", "synopsis": "When small-time con man Johnny Hooker (Robert Redford) and his partner, Luther (Robert Earl Jones), unwittingly con a numbers runner courier, they find themselves in danger from mobster Doyle Lonigan (Robert Shaw). When Hooker finds out that Lonigan's after them, he goes to warn Luther, but arrives too late. So Hooker teams up with Henry Gondorf (Paul Newman), a friend of Luther's. A con man himself, Gondorf sets an elaborate plan in motion to get back at Lonigan.", "download_slot": "www.filmaffinity.com", "mark": "8.5", "depth": 1, "country": "United States", "title": "The Sting", "duration": "129 min.", "cast": "Robert Redford Paul Newman Robert Shaw Charles Durning Ray Walston Eileen Brennan Harold Gould Dana Elcar John Heffernan Charles Dierkop Dimitra Arliss Robert Earl Jones Lee Paul Avon Long", "genre": "Mystery Comedy Drama", "year": "1973", "url": "https://www.filmaffinity.com/en/film385464.html"},
{"download_latency": 1.4989125728607178, "download_timeout": 180.0, "director": "Frank Darabont", "synopsis": "Andy Dufresne (Tim Robbins) is sentenced to two consecutive life terms in prison for the murders of his wife and her lover in the late 1940s. However, only Andy knows that he didn’t commit the crimes. Sent to Shawshank Prison to do hard time, Andy—a taciturn banker in the outside world, has to learn to get by in the brutal, cutthroat confines of prison life. His quiet strength slowly earns the respect of his fellow inmates -most notably, Red (Morgan Freeman)- and even much of the prison staff. But Andy’s seemingly stoic acceptance of his unjust imprisonment hides a fierce determination for freedom.", "download_slot": "www.filmaffinity.com", "mark": "8.6", "depth": 1, "country": "United States", "title": "The Shawshank Redemption", "duration": "142 min.", "cast": "Tim Robbins Morgan Freeman Bob Gunton James Whitmore Gil Bellows William Sadler Mark Rolston Clancy Brown David Proval Jeffrey DeMunn Jude Ciccolella Don McManus Alfonso Freeman Brian Libby Mack Miles Frank Medrano", "genre": "Drama", "year": "1994", "url": "https://www.filmaffinity.com/en/film161026.html"},
{"download_latency": 1.5196783542633057, "download_timeout": 180.0, "director": "Charles Chaplin", "synopsis": "In the 1930s, Tomania falls under the control of dictator Adenoid Hynkel, who dreams of world domination. In the Jewish district of the capital lives a barber who looks so much like Hynkel that he could be his twin. During the First World War, the barber had saved the life of a military pilot named Schultz, who has now become a commanding officer. Schultz pays the barber back by protecting the area in which he lives from anti-Semites. But when Schultz is arrested for being too friendly with Jews, both men are taken to a concentration camp. Later, the two men escape and the barber is mistaken for Hynkel. He takes the opportunity to make a radio speech in the dictator’s place.", "download_slot": "www.filmaffinity.com", "mark": "8.6", "depth": 1, "country": "United States", "title": "The Great Dictator ", "duration": "128 min.", "cast": "Charles Chaplin Paulette Goddard Jack Oakie Reginald Gardiner Henry Daniell Carter De Haven Grace Hayle Maurice Moscovitch Billy Gilbert", "genre": "Comedy", "year": "1940", "url": "https://www.filmaffinity.com/en/film155010.html"},
{"download_latency": 2.4960100650787354, "download_timeout": 180.0, "director": "Charles Chaplin", "synopsis": "The Little Tramp falls in love with a beautiful, blind flower girl (Virginia Cherrill). She believes he is wealthy and he, in turn, sets out to raise the money for the operation that could restore her sight.", "download_slot": "www.filmaffinity.com", "mark": "8.6", "depth": 1, "country": "United States", "title": "City Lights", "duration": "81 min.", "cast": "Charles Chaplin Virginia Cherrill Florence Lee Harry Myers Al Ernest Garcia Hank Mann Jack Alexander Tom Dempsey Henry Bergman", "genre": "Comedy Romance", "year": "1931", "url": "https://www.filmaffinity.com/en/film750301.html"},
{"download_latency": 2.5124194622039795, "download_timeout": 180.0, "director": "Billy Wilder", "synopsis": "Leonard Vole (Tyrone Power), a young and attractive man, is accused of the murder of Miss French, a rich old woman. Wilfred Roberts (Charles Laughton), a criminal lawyer from London, takes charge of the case.", "download_slot": "www.filmaffinity.com", "mark": "8.7", "depth": 1, "country": "United States", "title": "Witness for the Prosecution ", "duration": "114 min.", "cast": "Tyrone Power Marlene Dietrich Charles Laughton Elsa Lanchester John Williams Una O'Connor Henry Daniel Norma Varden Torin Thatcher Ian Wolfe Francis Compton", "genre": "Mystery Drama", "year": "1957", "url": "https://www.filmaffinity.com/en/film667376.html"},
{"download_latency": 1.1779115200042725, "download_timeout": 180.0, "director": "Masaki Kobayashi", "synopsis": "A ronin, a masterless samurai, requests permission to commit an honorable ritual suicide at the home of a powerful but sadistic warlord. The warlord is reluctant to permit this as he has been recently deceived by another ronin, who was trying to obtain charity from the house. This ronin, however, is permitted to tell the story of how he came to be in such a situation.", "download_slot": "www.filmaffinity.com", "mark": "8.5", "depth": 1, "country": "Japan", "title": "Harakiri ", "duration": "133 min.", "cast": "Tatsuya Nakadai Rentarô Mikuni Akira Ishihama Shima Iwashita Tetsurô Tanba Masao Mishima Ichirô Nakatani Kei Satô Yoshio Inaba Hisashi Igawa Tôru Takeuchi Yoshirô Aoki Tatsuo Matsumura Akiji Kobayashi Kôichi Hayashi Ryûtarô Gomi Jô Azumi Nakajirô Tomita Shichisaburô Amatsu Kenzô Tanaka Shin Nakahara Tsuneo Ikeda Minoru Miyagi Takaaki Kadota Satoshi Nishida Tetsurô Komiyama Shûichirô Narita Noboru Kasuga", "genre": "Drama", "year": "1962", "url": "https://www.filmaffinity.com/en/film209631.html"},
{"download_latency": 2.5219321250915527, "download_timeout": 180.0, "director": "Francis Ford Coppola", "synopsis": "Continuing saga of the Corleone family as they move to Nevada and make the casino business their major income source under the leadership of the increasingly paranoid and malevolent Michael, whose reign as the \"Don\" is juxtaposed against the parallel tale of his father's escape from Sicily as a young boy and his subsequent rise to power in New York's Lower East Side during the turn-of-the-century. ", "download_slot": "www.filmaffinity.com", "mark": "8.9", "depth": 1, "country": "United States", "title": "The Godfather: Part II", "duration": "200 min.", "cast": "Al Pacino Robert De Niro Diane Keaton Robert Duvall John Cazale Lee Strasberg Talia Shire Gastone Moschin Michael V. Gazzo Marianna Hill Bruno Kirby Danny Aiello Harry Dean Stanton Troy Donahue Roger Corman Morgana King Joe Spinell Richard Bright James Caan Dominic Chianese Francesca de Sapio G.D. Spradlin Frank Sivero Tito Alba Oreste Baldini", "genre": "Drama", "year": "1974", "url": "https://www.filmaffinity.com/en/film730528.html"},
{"download_latency": 0.29848265647888184, "download_timeout": 180.0, "director": "Michael Curtiz", "synopsis": "Humphrey Bogart plays Richard \"Rick\" Blaine, a cynical but good-hearted American whose café is the gathering place for everyone from the French Police to the black market to the Nazis. When his long-lost love, Ilsa (Ingrid Bergman), surfaces in Casablanca with her Resistance leader husband, Victor Laszlo (Paul Henreid), Rick is pulled into both a love triangle and a web of political intrigue. Ilsa and Victor need to escape from Casablanca, and Rick may be the only one who can help them. The question is, will he? ", "download_slot": "www.filmaffinity.com", "mark": "8.4", "depth": 1, "country": "United States", "title": "Casablanca", "duration": "102 min.", "cast": "Humphrey Bogart Ingrid Bergman Paul Henreid Claude Rains Conrad Veidt Sydney Greenstreet Peter Lorre S.Z. Sakall Madeleine LeBeau Dooley Wilson Joy Page John Qualen Leonid Kinskey Curt Bois Ed Agresti Marcel Dalio Enrique Acosta Louis V. Arco Frank Arnold Leon Belasco Oliver Blake", "genre": "Drama Romance", "year": "1942", "url": "https://www.filmaffinity.com/en/film165208.html"},
{"download_latency": 2.563286781311035, "download_timeout": 180.0, "director": "Sidney Lumet", "synopsis": "Eleven jurors are convinced that the defendant is guilty of murder. The twelfth has no doubt of his innocence. How can this one man steer the others toward the same conclusion?", "download_slot": "www.filmaffinity.com", "mark": "8.7", "depth": 1, "country": "United States", "title": "12 Angry Men", "duration": "95 min.", "cast": "Henry Fonda Lee J. Cobb Jack Warden E.G. Marshall Martin Balsam Ed Begley John Fiedler Robert Webber Jack Klugman George Voskovec Joseph Sweeney Edward Binns Billy Nelson John Savoca Rudy Bond James Kelly", "genre": "Drama Mystery", "year": "1957", "url": "https://www.filmaffinity.com/en/film695552.html"},
{"download_latency": 2.549485683441162, "download_timeout": 180.0, "director": "Stanley Kubrick", "synopsis": "Colonel Dax (Kirk Douglas) is the commander of the battle-decimated 701st Infantry Regiment of the French Army, dug in along the Western Front in a stalemated WWI. It is 1916 and the Allies have been struggling to overcome an equally determined German war machine for two years. Dax, who was a criminal lawyer during peacetime, hopes that his regiment will be relieved from front-line duty. The high command has other plans. The generals General Broulard (Adolphe Menjou), corps commander and suave representative of the high command arrive at the placid, beautiful chateau that serves as headquarters for General Mireau (George Macready), the divisional general in charge. Broulard tells Mireau that his division has been dormant and must now make an all-out attack against an impregnable German position nicknamed the Ant Hill and that this position must be captured within 48 hours.", "download_slot": "www.filmaffinity.com", "mark": "8.5", "depth": 1, "country": "United States", "title": "Paths of Glory", "duration": "86 min.", "cast": "Kirk Douglas George MacReady Adolphe Menjou Ralph Meeker Wayne Morris Joe Turkel Richard Anderson Timothy Carey Peter Capell Susanne Christian Bert Freed Emile Meyer", "genre": "War Drama", "year": "1957", "url": "https://www.filmaffinity.com/en/film448956.html"},
{"download_latency": 2.550140857696533, "download_timeout": 180.0, "director": "Billy Wilder", "synopsis": "Unsuspecting Mr. Dietrichson becomes increasingly accident prone after his icily calculating wife (Barbara Stanwyck) encourages him to sign a double indemnity policy proposed by a smooth-talking insurance agent (Fred MacMurray). Against a backdrop of distinctly California settings, the partners in crime plan the perfect murder to collect on the insurance. Perfect until a claims manager (Edward G. Robinson) gets a familiar feeling of foul play and pursues the matter relentlessly. Tension soars as the would-be lovers find themselves plotting against each other.", "download_slot": "www.filmaffinity.com", "mark": "8.5", "depth": 1, "country": "United States", "title": "Double Indemnity ", "duration": "106 min.", "cast": "Fred MacMurray Barbara Stanwyck Edward G. Robinson Tom Powers Porter Hall Jean Heather Byron Barr Richard Gaines Fortunio Bonanova John Philliber Bess Flowers Miriam Nelson", "genre": "Film noir Mystery Thriller", "year": "1944", "url": "https://www.filmaffinity.com/en/film207165.html"},
{"download_latency": 2.550967216491699, "download_timeout": 180.0, "director": "Joseph L. Mankiewicz", "synopsis": "Margo Channing (Bette Davis), leading dame of the New York stage, is pushed aside by a fresh-faced fan who becomes her understudy, the duplicitous Eve (Anne Baxter). Eve’s humble background and eager innocence fools all while she subtly digs in her claws, tearing Margo from her friends and colleagues as she desperately grasps her chance for stardom.", "download_slot": "www.filmaffinity.com", "mark": "8.5", "depth": 1, "country": "United States", "title": "All About Eve", "duration": "138 min.", "cast": "Bette Davis Anne Baxter George Sanders Celeste Holm Gary Merrill Hugh Marlowe Gregory Ratoff Barbara Bates Marilyn Monroe Thelma Ritter", "genre": "Drama", "year": "1950", "url": "https://www.filmaffinity.com/en/film412657.html"},
{"download_latency": 2.5575754642486572, "download_timeout": 180.0, "director": "Roberto Benigni", "synopsis": "Guido - a charming but bumbling waiter who's gifted with a colourful imagination and an irresistible sense of humour - has won the heart of the woman he loves and has created a beautiful life for his young family. But then, that life is threatened by World War II and Guido must rely on those very same strengths to save his beloved wife and son from an unthinkable fate.", "download_slot": "www.filmaffinity.com", "mark": "8.5", "depth": 1, "country": "Italy", "title": "Life Is Beautiful", "duration": "117 min.", "cast": "Roberto Benigni Nicoletta Braschi Giorgio Cantarini Marisa Paredes Giustino Durano Horst Buchholz Sergio Bini Bustric", "genre": "Comedy Drama", "year": "1997", "url": "https://www.filmaffinity.com/en/film594480.html"},
{"download_latency": 1.415855884552002, "download_timeout": 180.0, "director": "Jacques Becker", "synopsis": "Year 1947. In France, a young man, Gaspard Claude, is convicted for the attempted murder of his wife, although he is innocent of the crime. He is sent to the notorious Santé Prison in Paris and is placed in a cell with four hardened criminals. The latter have decided to escape from the prison by digging their way out of their cell. Reluctantly, they take Gaspard into their confidence and labour intensely to effect their escape. Then, just when escape appears certain, Gaspard is called away to see the prison governor... ", "download_slot": "www.filmaffinity.com", "mark": "8.4", "depth": 1, "country": "France", "title": "The Hole (The Night Watch)", "duration": "113 min.", "cast": "Philippe Leroy Marc Michel Michel Constantin Jean Kéraudy Raymond Meunier André Bervil", "genre": "Drama", "year": "1960", "url": "https://www.filmaffinity.com/en/film803236.html"},
{"download_latency": 1.478309154510498, "download_timeout": 180.0, "director": "Martin Scorsese", "synopsis": "As a poor Irish-Italian growing up in 1950s New York City, Henry Hill rises through the ranks of his Brooklyn neighborhood's crime branch, and with money from the mob he begins living the good life, complete with a beautiful bride, a fancy home, and the best seats at the most exclusive restaurants. A botched robbery lands Henry in prison for a brief period of time, and when he gets released, his reckless infidelities and drug abuse damage his associations with his adopted family.", "download_slot": "www.filmaffinity.com", "mark": "8.4", "depth": 1, "country": "United States", "title": "Goodfellas", "duration": "148 min.", "cast": "Ray Liotta Robert De Niro Joe Pesci Lorraine Bracco Paul Sorvino Chuck Low Christopher Serrone Debi Mazar Gina Mastrogiacomo Frank Sivero Illeana Douglas Tony Darrow Frank DiLeo Frank Vincent Mike Starr Catherine Scorsese Michael Imperioli Welker White Suzanne Shepherd Margo Winkler Samuel L. Jackson Elaine Kagan Beau Starr", "genre": "Thriller Drama", "year": "1990", "url": "https://www.filmaffinity.com/en/film978961.html"},
{"download_latency": 1.427839994430542, "download_timeout": 180.0, "director": "F.W. Murnau", "synopsis": "A farmer (George O' Brien) lives happily with his wife (Janet Gaynor) until he meets an attractive woman from the city (Margaret Livingstone). The farmer falls in love with this sophisticated woman and starts to think that his wife is standing in the way of their love.", "download_slot": "www.filmaffinity.com", "mark": "8.4", "depth": 1, "country": "United States", "title": "Sunrise", "duration": "94 min.", "cast": "George O'Brien Janet Gaynor Margaret Livingston Bodil Rosing J. Farrell MacDonald", "genre": "Drama Romance", "year": "1927", "url": "https://www.filmaffinity.com/en/film357856.html"},
{"download_latency": 1.4994356632232666, "download_timeout": 180.0, "director": "Alfred Hitchcock", "synopsis": "Office worker Marion Crane is fed up with the way life has treated her. One Friday Marion is entrusted with $40,000 to take to the bank. Seeing the opportunity to keep the money and start a new life, Marion leaves town. Tired after the long drive and caught in a storm, she gets off the main highway and pulls into The Bates Motel. The motel Manager Norman Bates oddly seems to be dominated by his mother.", "download_slot": "www.filmaffinity.com", "mark": "8.4", "depth": 1, "country": "United States", "title": "Psycho", "duration": "109 min.", "cast": "Anthony Perkins Janet Leigh John Gavin Vera Miles John McIntire Martin Balsam Simon Oakland Patricia Hitchcock", "genre": "Horror Mystery Thriller", "year": "1960", "url": "https://www.filmaffinity.com/en/film363992.html"},
{"download_latency": 1.4443433284759521, "download_timeout": 180.0, "director": "Charles Chaplin", "synopsis": "'The Kid' is the story of a child abandoned in a limousine by his unwed mother (Edna Purviance). When The Little Tramp finds him, he tries unsuccessfully to find a home for the boy. Obliged to keep him, The Little Tramp teaches the youngster about life on the streets and just as they have bonded and become a family, everything gets complicated. ", "download_slot": "www.filmaffinity.com", "mark": "8.4", "depth": 1, "country": "United States", "title": "The Kid ", "duration": "68 min.", "cast": "Charles Chaplin Jackie Coogan Edna Purviance Carl Miller Tom Wilson Henry Bergman Lita Grey", "genre": "Comedy Drama", "year": "1921", "url": "https://www.filmaffinity.com/en/film344683.html"},
{"download_latency": 1.5177059173583984, "download_timeout": 180.0, "director": "Charles Chaplin", "synopsis": "The Lone Prospector, a valiant weakling, seeks fame and fortune in the Alaskan wilderness. There, he meets Black Larson (Tom Murray) and large but gentler Big Jim McKay (Mack Swain), with whom he has some run-ins. Later on, at a dance hall, he encounters lovely young Georgia (Georgia Hale) and everything changes when he falls in love with her.", "download_slot": "www.filmaffinity.com", "mark": "8.4", "depth": 1, "country": "United States", "title": "The Gold Rush", "duration": "95 min.", "cast": "Charles Chaplin Mack Swain Georgia Hale Tom Murray Malcom Waite Henry Bergman Betty Morrisey", "genre": "Comedy Drama Adventure", "year": "1925", "url": "https://www.filmaffinity.com/en/film811454.html"},
{"download_latency": 1.5018174648284912, "download_timeout": 180.0, "director": "Fernando Meirelles", "synopsis": "Cidade de Deus (City of God) is a housing project built in the 1960's that--in the early 80's--became one of the most dangerous places in Rio de Janeiro. The tale tells the stories of many characters whose lives sometimes intersect. However, all is seen through the eyes of a singular narrator: Busca-Pé, a poor black youth too frail and scared to become an outlaw but also to smart to be content with underpaid, menial jobs. He grows up in a very violent environment. The odds are all against him. But Busca-Pé soon discovers that he can see reality differently than others. His redemption is that he's been given an artist's point of view as a keen-eyed photographer. As Busca-Pé is not the real protagonist of the film--only the narrator--he is not the one who makes the decisions that will determine the sequence of events. Nevertheless, not only his life is attached to what happens in the story, but it is also through Busca-Pé's perspective of life that one can understand the complicated layers and humanity of a world, apparently condemned to endless violence.", "download_slot": "www.filmaffinity.com", "mark": "8.4", "depth": 1, "country": "Brazil", "title": "City of God", "duration": "130 min.", "cast": "Alexandre Rodrigues Leandro Firmino Phellipe Haagensen Douglas Silva Seu Jorge Jonathan Haagensen Matheus Nachtergaele Jefechander Suplino Alice Braga Emerson Gomes Luis Otávio Babu Santana Gero Camilo", "genre": "Drama", "year": "2002", "url": "https://www.filmaffinity.com/en/film412004.html"},
{"download_latency": 2.6752164363861084, "download_timeout": 180.0, "director": "Milos Forman", "synopsis": "A misbehaved con named McMurphy (Jack Nicholson), who shirks authority, finds himself in an asylum after faking insanity to get out of work detail in prison. The troublemaker soon finds himself in a place that's worse than prison when he meets Nurse Ratched (Louise Fletcher), whose set of rules and regulations are meant to suppress patients' psychotic outbursts, and their spirits. It's not long before McMurphy is reaching out to his new inmates, trying desperately to bring life to an otherwise dead atmosphere and pit them against the dictatorship of Ratched, who thinks McMurphy's free spirit is as dangerous as a schizophrenic impulse.", "download_slot": "www.filmaffinity.com", "mark": "8.4", "depth": 1, "country": "United States", "title": "One Flew Over the Cuckoo's Nest", "duration": "133 min.", "cast": "Jack Nicholson Louise Fletcher Brad Dourif William Redfield Mews Small Sydney Lassick Will Sampson Christopher Lloyd Danny DeVito Dean R. Brooks William Duell Scatman Crothers Nathan George Delos V. Smith Vincent Schiavelli", "genre": "Drama", "year": "1975", "url": "https://www.filmaffinity.com/en/film371621.html"},
{"download_latency": 0.4064490795135498, "download_timeout": 180.0, "director": "Akira Kurosawa", "synopsis": "In the Nineteenth Century, in Japan, the arrogant and proud just-graduated Dr. Noboru Yasumoto (Yuzo Kayama) is forced to work in the Koshikawa Clinic, a non-profit health facility ruled by Dr. Kyojio Niide (Toshirô Mifune), a.k.a. \"Red Beard\". \"Red Beard\" is a good, sentimental, but also very firm, strong and fair man. While in the clinic, Dr. Yasumoto becomes responsible for healing the hurt teenager Otoyo (Terumi Niki), and he learns a lesson of humanity, becoming a better man.", "download_slot": "www.filmaffinity.com", "mark": "8.3", "depth": 2, "country": "Japan", "title": "Red Beard", "duration": "180 min.", "cast": "Toshirô Mifune Yuzo Kayama Yoshio Tsuchiya Tatsuyoshi Ehara Reiko Dan Kyôko Kagawa Kamatari Fujiwara Akemi Negishi Tsutomu Yamazaki", "genre": "Drama", "year": "1965", "url": "https://www.filmaffinity.com/en/film418007.html"},
{"download_latency": 1.792313575744629, "download_timeout": 180.0, "director": "Akira Kurosawa", "synopsis": "It is the story of Gondo, a shoe company executive (Toshirô Mifune) planning a boardroom intrigue to gain control of the company. He has raised the capital for his plan, when word comes that his son has been kidnapped for ransom. All the money he has raised will be sunk into the ransom. Any price to get his son back, thinks Gondo. But what about somebody else's son?", "download_slot": "www.filmaffinity.com", "mark": "8.4", "depth": 1, "country": "Japan", "title": "High and Low", "duration": "143 min.", "cast": "Toshirô Mifune Kyoko Kagawa Yutaka Sada Takashi Shimura Tatsuya Mihashi Tatsuya Nakadai", "genre": "Film noir Thriller Mystery Drama", "year": "1963", "url": "https://www.filmaffinity.com/en/film914275.html"},
{"download_latency": 1.7848503589630127, "download_timeout": 180.0, "director": "Billy Wilder", "synopsis": "C.C. Baxter (Jack Lemmon) is an office clerk who curries favor with the executives in his office by giving them the key to his small apartment for the odd afternoon dalliance. Among them is his callous boss, J.D. Sheldrake (Fred MacMurray), who Baxter eventually learns is using his place to sleep with Miss Kubelik (Shirley MacLaine), the sweet elevator operator the clerk has loved from afar. When Sheldrake coldly dumps the vulnerable young woman, she tries to commit suicide, but is saved by the intervention of Baxter.", "download_slot": "www.filmaffinity.com", "mark": "8.4", "depth": 1, "country": "United States", "title": "The Apartment", "duration": "125 min.", "cast": "Jack Lemmon Shirley MacLaine Fred MacMurray Ray Walston Edie Adams Jack Kruschen Joan Shawlee Hope Holiday David Lewis Naomi Stevens Johnny Seven Joyce Jameson Willard Waterman David White", "genre": "Comedy Romance Drama", "year": "1960", "url": "https://www.filmaffinity.com/en/film795770.html"},
{"download_latency": 1.747269630432129, "download_timeout": 180.0, "director": "Billy Wilder", "synopsis": "A bankrupt screenwriter (William Holden) takes refuge in the mansion of a faded star (Gloria Swanson) of the silent era, in order to escape the debt-collectors who are chasing after him. What he begins to realize however, is that Norma's psyche is no less of a dangerous place. A brillant comment on the meaning of fame.", "download_slot": "www.filmaffinity.com", "mark": "8.5", "depth": 1, "country": "United States", "title": "Sunset Boulevard", "duration": "110 min.", "cast": "William Holden Gloria Swanson Erich von Stroheim Nancy Olson Lloyd Gough Jack Webb Fred Clark Cecil B. DeMille Buster Keaton Anna Q. Nilsson Hedda Hopper H.B. Warner Franklyn Farnum Julia Faye Ruth Clifford", "genre": "Film noir Drama", "year": "1950", "url": "https://www.filmaffinity.com/en/film536488.html"},
{"download_latency": 1.7076480388641357, "download_timeout": 180.0, "director": "Tony Kaye", "synopsis": "Derek Vinyard (Edward Norton) is a Southern Californian skinhead who must do time after committing a hateful murder. Once in jail, his mind opens and he sees the error of his ways. Upon reentering the real world, he must now turn his attentions to his younger brother Danny (Edward Furlong), who is swiftly heading down the same path as his brother.", "download_slot": "www.filmaffinity.com", "mark": "8.3", "depth": 2, "country": "United States", "title": "American History X", "duration": "119 min.", "cast": "Edward Norton Edward Furlong Fairuza Balk Stacy Keach Elliott Gould Avery Brooks Beverly D'Angelo Jennifer Lien Guy Torry Ethan Suplee Keram Malicki-Sanchez", "genre": "Drama", "year": "1998", "url": "https://www.filmaffinity.com/en/film261972.html"},
{"download_latency": 1.7670998573303223, "download_timeout": 180.0, "director": "Akira Kurosawa", "synopsis": "Set in 16th Century Japan, Akira Kurosawa's 'Seven Samurai' follows the plight of a defenseless farming village that lives in constant fear of marauding bandits. The farmers know that when their crops are harvested, the thugs will attack, so four men go to town in hopes of employing samurai to fight for them. However, the poor villagers can merely offer payment in the form of shelter and a daily bowl of rice, and initially only Kambei (Takashi Shimura), a brave elder samurai, and his eager young apprentice, Katsushiro (Isao Kimura), take up their cause. Encountering various nomadic warriors on the streets, they slowly put together his team of swordsmen, recruiting Shichiroji (Daisuke Katô), Gorobei (Yoshio Inaba), Heihachi (Minoru Chiaki), and Kyuzo (Seiji Miyaguchi). Finally, Kikuchiyo (Toshirô Mifune), a scruffy wanderer who has been trailing them, completes the small band of ronin. However, upon reaching the village, the samurai learn that the farmers fear them as much as the enemy. Despite the tensions, Kambei and his men slowly train the peasants to defend their village.", "download_slot": "www.filmaffinity.com", "mark": "8.5", "depth": 1, "country": "Japan", "title": "Seven Samurai", "duration": "205 min.", "cast": "Toshirô Mifune Takashi Shimura Yoshio Inaba Seiji Miyaguchi Minoru Chiaki Daisuke Katô Ko Kimura Kamatari Fujiwara Keiko Tsushima Yoshio Tsuchiya Kokuten Kôdô", "genre": "Adventure Drama", "year": "1954", "url": "https://www.filmaffinity.com/en/film168398.html"},
{"download_latency": 2.371237277984619, "download_timeout": 180.0, "director": "Ernst Lubitsch", "synopsis": "Joseph Tura and his wife Maria top the bill at a Warsaw theatre company. Young aviator Lieutenant Sobinski is madly in love with the girl and the two arrange to meet in her dressing room during the play they are putting on (Hamlet). He leaves the theatre to see her just as Joseph starts the 'To be or not to be' soliloquy. Germany invades Poland and Sobinski has to leave for England, although he will have to return to Warsaw to disarticulate a conspiration against the underground movement. ", "download_slot": "www.filmaffinity.com", "mark": "8.5", "depth": 1, "country": "United States", "title": "To Be or Not to Be ", "duration": "99 min.", "cast": "Carole Lombard Jack Benny Robert Stack Stanley Ridges Felix Bressart Lionel Atwill Sig Ruman Tom Dugan Charles Halton George Lynn", "genre": "Comedy Mystery", "year": "1942", "url": "https://www.filmaffinity.com/en/film684718.html"},
{"download_latency": 2.4946370124816895, "download_timeout": 180.0, "director": "Masaki Kobayashi", "synopsis": "The protagonist is the pacifistic Kaji. Strong-armed into the Japanese military during World War II, Kaji has reluctantly learned to kill on the battlefields. Upon his country's surrender, Kaji and some comrades embark on an epic journey on foot southward to where Kaji hopes to rejoin Michiko. After surviving many perils he is captured by the Red Army and subjected to treatment that echoes that meted out to the Chinese.", "download_slot": "www.filmaffinity.com", "mark": "8.3", "depth": 2, "country": "Japan", "title": "The Human Condition III: A Soldier's Prayer", "duration": "190 min.", "cast": "Tatsuya Nakadai Michiyo Aratama Yusuke Kawazu Tamao Nakamura Chishu Ryu Taketoshi Naitô Reiko Hitomi Kyôko Kishida Nobuo Kaneko Fujio Suga Keijiro Morozumi", "genre": "War Drama", "year": "1961", "url": "https://www.filmaffinity.com/en/film106223.html"},
{"download_latency": 0.7931740283966064, "download_timeout": 180.0, "director": "Toby Haynes", "synopsis": "Moriarty comes close to stealing the Crown Jewels to prove it might be done but allows himself to be caught. Sherlock gives evidence at the trial where Moriarty has scared the jury into acquitting him and later visits Sherlock,camply taunting him with his superior computer skills,seemingly capable of any crime. Sherlock rescues two children abducted by his enemy but his brilliantly accurate deductions lead the police to believe that he may have been an accomplice in the kidnapping and he is arrested,going on the run with John. After a further encounter with Moriarty,who has persuaded a journalist to publish that he is an innocent actor paid by Sherlock to masquerade as his enemy for Sherlock's own glory,the two meet atop a very high building... ", "download_slot": "www.filmaffinity.com", "mark": "8.3", "depth": 2, "country": "United Kingdom", "title": "Sherlock: The Reichenbach Fall (TV)", "duration": "90 min.", "cast": "Benedict Cumberbatch Martin Freeman Andrew Scott Mark Gatiss Louise Brealey Una Stubbs Rupert Graves Katherine Parkinson Vinette Robinson Jonathan Aris Tanya Moodie Jaye Griffiths Ian Hallard Tony Pitts", "genre": "Mystery", "year": "2012", "url": "https://www.filmaffinity.com/en/film154475.html"},
{"download_latency": 1.3973095417022705, "download_timeout": 180.0, "director": "Carol Reed", "synopsis": "Holly Martins (Joseph Cotten), a pulp novelist who has come to post-WWII Vienna with the promise of work from his friend, Harry Lime (Orson Welles). When he finds that Lime has just been killed in a questionable car accident, he decides to remain in the city to investigate his friend's demise.", "download_slot": "www.filmaffinity.com", "mark": "8.3", "depth": 2, "country": "United Kingdom", "title": "The Third Man ", "duration": "104 min.", "cast": "Joseph Cotten Alida Valli Trevor Howard Orson Welles Bernard Lee Paul Hörbiger Ernst Deutsch Siegfried Breuer Erich Ponto Wilfrid Hyde-White Hedwig Bleibtreu", "genre": "Film noir Mystery Drama", "year": "1949", "url": "https://www.filmaffinity.com/en/film357391.html"},
{"download_latency": 1.3606383800506592, "download_timeout": 180.0, "director": "Alfred Hitchcock", "synopsis": "A naïve and somewhat simple young woman (Joan Fontaine), is working as a hired travel companion for decadent, rich ladies. On one of her assignments she ends up in Monte Carlo at the French Riviera where she gets to meet the handsome Maxim DeWinter (Laurence Olivier), a wealthy and respectable widower. DeWinter is quickly attracted to the young and insecure woman and decides to marry her improptu. The two return to DeWinter’s residence, Manderley, a castle-like estate that seems to come right out of a fairy-tale.", "download_slot": "www.filmaffinity.com", "mark": "8.3", "depth": 2, "country": "United States", "title": "Rebecca", "duration": "130 min.", "cast": "Laurence Olivier Joan Fontaine George Sanders Judith Anderson Nigel Bruce Reginald Denny C. Aubrey Smith Gladys Cooper", "genre": "Drama Mystery", "year": "1940", "url": "https://www.filmaffinity.com/en/film167667.html"},
{"download_latency": 1.422379970550537, "download_timeout": 180.0, "director": "Yasujiro Ozu", "synopsis": "An elderly couple visit their children in Tokyo, only to be passed around from family to family.", "download_slot": "www.filmaffinity.com", "mark": "8.3", "depth": 2, "country": "Japan", "title": "Tokyo Story ", "duration": "139 min.", "cast": "Chishu Ryu Chieko Higashiyama Setsuko Hara Sô Yamamura Haruko Sugimura Kuniko Miyake Kyôko Kagawa Eijirô Tono Nobuo Nakamura Shirô Ôsaka Hisao Toake Teruko Nagaoka Mutsuko Sakura Toyo Takahashi Toru Abe Sachiko Mitani", "genre": "Drama", "year": "1953", "url": "https://www.filmaffinity.com/en/film911508.html"},
{"download_latency": 2.009687900543213, "download_timeout": 180.0, "director": "David Fincher", "synopsis": "Set in a perpetually gloomy unnamed city, the film follows Somerset (Morgan Freeman), a retiring police detective, as he experiences his final week on the job, reluctantly working with assertive newcomer Mills (Brad Pitt). When an obese man is found brutally murdered in his home, the seasoned Somerset realizes this is no ordinary killing--someone tortured him because of his appetite. Slayings that reflect the sins of greed and sloth soon follow, leading Somerset and Mills on a desperate search to find the mysterious John Doe, who is responsible for these methodical murders. As the case builds to a startling conclusion, both Somerset and Mills become more involved than they ever could have imagined.", "download_slot": "www.filmaffinity.com", "mark": "8.3", "depth": 2, "country": "United States", "title": "Seven (Se7en)", "duration": "127 min.", "cast": "Brad Pitt Morgan Freeman Gwyneth Paltrow Kevin Spacey John C. McGinley Richard Roundtree R. Lee Ermey Leland Orser Richard Schiff Julie Araskog Mark Boone Junior Daniel Zacapa Richard Portnow Bob Stephenson John Cassini Lennie Loftin Reg E. Cathey Michael Massee", "genre": "Thriller Mystery", "year": "1995", "url": "https://www.filmaffinity.com/en/film575149.html"},
{"download_latency": 1.6533513069152832, "download_timeout": 180.0, "director": "Luis García Berlanga", "synopsis": "An undertaker's assistant marries an executioner's daughter, and the new groom takes on his father-in-law's job but grows real squeamish when the time comes to execute someone. UK TimeOut movie critic wrote: \"Regularly voted by its country's critics as the best Spanish film of all time, Berlanga's brilliant dark comedy on the peculiar horror of the garotte has not lost its power over the years.\"", "download_slot": "www.filmaffinity.com", "mark": "8.3", "depth": 2, "country": "Spain", "title": "The Executioner ", "duration": "90 min.", "cast": "José Isbert Nino Manfredi Emma Penella José Luis López Vázquez Ángel Álvarez María Luisa Ponte María Isbert Julia Caba Alba Guido Alberti Erasmo Pascual Xan das Bolas José Orjas José María Prada Félix Fernández Antonio Ferrandis Lola Gaos Alfredo Landa José Sazatornil Agustín González Chus Lampreave José Luis Coll José Cordero Pedro Beltrán Dolores García Emilio Laguna Enrique Tusquets Enrique Pelayo", "genre": "Comedy", "year": "1963", "url": "https://www.filmaffinity.com/en/film411856.html"},
{"download_latency": 1.6080787181854248, "download_timeout": 180.0, "director": "Juan Jose Meza-Leon", "synopsis": "In the wake of the great human genocide, the Smith family comes to realize that Rick's technology is the only hope left for humanity to survive. Problem is, only Rick knows where it is, and he's in prison. In an effort to locate the missing tech, the Smith family stage a prison break. ", "download_slot": "www.filmaffinity.com", "mark": "8.3", "depth": 2, "country": "United States", "title": "Rick and Morty: The Rickshank Redemption (TV) (S)", "duration": "22 min.", "cast": "Animation", "genre": "Animation Comedy", "year": "2017", "url": "https://www.filmaffinity.com/en/film514619.html"},
{"download_latency": 1.6854748725891113, "download_timeout": 180.0, "director": "Alfred Hitchcock", "synopsis": "San Francisco police detective Scottie Fergusson (James Stewart) develops a fear of heights and is forced to retire when a colleague falls to his death during a chase. An old college friend hires Scottie to watch his wife Madeleine (Kim Novak) who has reportedly become possessed by her ancestor's spirit named Carlotta. Scottie follows her around San Francisco and is drawn to Madeleine and her obsession with death. He unwittingly becomes a figure in a complex plot, and is determined to discover the truth behind it all.", "download_slot": "www.filmaffinity.com", "mark": "8.3", "depth": 2, "country": "United States", "title": "Vertigo", "duration": "120 min.", "cast": "James Stewart Kim Novak Henry Jones Barbara Bel Geddes Tom Helmore Raymond Bailey Ellen Corby Lee Patrick Konstantin Shayne", "genre": "Mystery", "year": "1958", "url": "https://www.filmaffinity.com/en/film647094.html"},
{"download_latency": 2.392543077468872, "download_timeout": 180.0, "director": "Roman Polanski", "synopsis": "The film is adapted from the autobiography of Wladyslaw Szpilman, a Polish Jew who detailed his survival during World War II. A composer and a pianist, he played the last live music heard over Polish radio airwaves before Nazi artillery hit. During the brutal occupation, he eluded deportation and remained in the devastated Warsaw ghetto. There, he struggled to stay alive even when cast away from those he loved. He would eventually reclaim his artistic gifts and confront his fears, with aid from the unlikeliest of sources.", "download_slot": "www.filmaffinity.com", "mark": "8.3", "depth": 2, "country": "United Kingdom", "title": "The Pianist", "duration": "148 min.", "cast": "Adrien Brody Thomas Kretschmann Maureen Lipman Ed Stoppard Emilia Fox Frank Finlay Julia Rayner Jessica Kate Meyer", "genre": "Drama", "year": "2002", "url": "https://www.filmaffinity.com/en/film112475.html"},
{"download_latency": 2.633399724960327, "download_timeout": 180.0, "director": "Alfred Hitchcock", "synopsis": "Roger Thornhill (Cary Grant) finds himself in the wrong place at the wrong time. Suddenly, the hapless businessman is targeted as an American intelligence agent and set up as a killer. All of Thornhills attempts to straighten things out only make matters worse--and soon the desperate man is on the run from murderous foreign operatives, the CIA and the police.", "download_slot": "www.filmaffinity.com", "mark": "8.3", "depth": 2, "country": "United States", "title": "North by Northwest", "duration": "136 min.", "cast": "Cary Grant Eva Marie Saint James Mason Martin Landau Leo G. Carroll Philip Ober Josephine Hutchinson Edward Platt Adam Williams Jessie Royce Landis Alfred Hitchcock Edward Binns", "genre": "Mystery", "year": "1959", "url": "https://www.filmaffinity.com/en/film351704.html"},
{"download_latency": 2.5694358348846436, "download_timeout": 180.0, "director": "Charles Chaplin", "synopsis": "An old clown (Charles Chaplin), after preventing the suicide of a young dancer (Claire Bloom), takes care of her and tries to teach her everything he knows about theater so she can succeed.", "download_slot": "www.filmaffinity.com", "mark": "8.3", "depth": 2, "country": "United States", "title": "Limelight ", "duration": "145 min.", "cast": "Charles Chaplin Claire Bloom Nigel Bruce Sydney Chaplin Norman Lloyd Buster Keaton Melissa Hayden Geraldine Chaplin", "genre": "Drama Romance", "year": "1952", "url": "https://www.filmaffinity.com/en/film186605.html"},
{"download_latency": 1.6561157703399658, "download_timeout": 180.0, "director": "Fritz Lang", "synopsis": "Chris Cross (Edward G. Robinson), a mild mannered bank clerk, celebrates his 25 years of service, but he is unhappy with his dead end job and his shrieking harpy of a wife. The only pleasure he finds in his life is painting, which he does as a hobby. On the way home from his 25th anniversary dinner, Chris sees Kitty March (Joan Bennett) being slapped around by a man, her slimy boyfriend Johnny (Dan Duryea). Chris chases Johnny off and begins to see Kitty socially. Unfortunately for Chris, Kitty has no interest in him whatsoever, and egged on by Johnny, seeks to bleed him for money. Even more unfortunately for Chris, his comments about painting give Kitty and Johnny the mistaken impression, that he is a rich and famous artist. They set out to squeeze as much money as they can out of Chris, who is now hopelessly in love with Kitty.", "download_slot": "www.filmaffinity.com", "mark": "8.3", "depth": 2, "country": "United States", "title": "Scarlet Street", "duration": "103 min.", "cast": "Edward G. Robinson Joan Bennett Dan Duryea Jess Baker Margaret Lindsay Rosalind Ivan Samuel S. Hinds Vladimir Sokoloff", "genre": "Film noir Drama", "year": "1945", "url": "https://www.filmaffinity.com/en/film755307.html"},
{"download_latency": 0.8637316226959229, "download_timeout": 180.0, "director": "Erich von Stroheim", "synopsis": "Miner-turned-dentist McTeague wins young Trina Sieppe away from her cousin Marcus, McTeague's friend. When Trina wins five thousand dollars in a lottery, Marcus accuses McTeague of marrying her for her money. Trina becomes more and more obsessed with money, refusing to spend any of her winnings even though she and her husband are forced into dire straits. When Marcus informs the authorities that McTeague is not licensed as a dentist, thus depriving him of his meagre living, the friendship and the marriage are destroyed. At last murder intrudes, leaving no one unscathed.", "download_slot": "www.filmaffinity.com", "mark": "8.2", "depth": 3, "country": "United States", "title": "Greed", "duration": "239 min.", "cast": "Gibson Gowland Zasu Pitts Jean Hersholt Chester Conklin Sylvia Ashton Dale Fuller Joan Standing Austin Jewel", "genre": "Drama", "year": "1924", "url": "https://www.filmaffinity.com/en/film724826.html"},
{"download_latency": 0.23468756675720215, "download_timeout": 180.0, "director": "Frank Capra", "synopsis": "A good but slightly ineffectual man tries to off himself after an error that really wasnt his fault. In Christmas carol fashion, his crusty-but-lovable guardian angel shows up to give him a tour of the world without his presence, and it isnt a pretty place. Moral courage, small-town American life, civic cooperation, and family love are glorified; corporate greed and self-involvement are vilified; at the climax, a blanket of snow like spun sugar makes everything pure and clean like redemption itself.", "download_slot": "www.filmaffinity.com", "mark": "8.2", "depth": 3, "country": "United States", "title": "It's a Wonderful Life ", "duration": "130 min.", "cast": "James Stewart Donna Reed Lionel Barrymore Thomas Mitchell Henry Travers Beulah Bondi Frank Faylen Ward Bond Gloria Grahame H.B. Warner Frank Albertson Todd Karns Samuel S. Hinds Mary Treen Virginia Patton Charles Williams Argentina Brunetti", "genre": "Drama Fantasy", "year": "1946", "url": "https://www.filmaffinity.com/en/film682814.html"},
{"download_latency": 2.340313673019409, "download_timeout": 180.0, "director": "Kenji Mizoguchi", "synopsis": "'Sansho Dayu' reaches back to a Japanese folk tale of the 12th century to depict the barbarism of a dark age, when people didn't know how to be human. When a provincial governor's attempts to protect the rights of regional farmers clash with the goals of the feudal regime, he's sent into exile, and forced to leave his family behind. A few years later his wife and children begin a long journey to reunite with him, only to be waylaid be kidnappers. The bandits sell the mother to a brothel on an isolated island and the children to corrupt official Sansho as slaves. As the years pass, the daughter lapses into passivity while the son becomes hardened by the brutality that has become their lot. One day, while escorting a dying slave outside the confines of their camp, they plan an escape.", "download_slot": "www.filmaffinity.com", "mark": "8.3", "depth": 2, "country": "Japan", "title": "Sansho the Bailiff", "duration": "123 min.", "cast": "Kinuyo Tanaka Yoshiaki Hanayaki Kyoko Kagawa Eitaro Shindo Akitate Kono Masao Shimizu Ken Mitsuda Kazukimi Okuni", "genre": "Drama", "year": "1954", "url": "https://www.filmaffinity.com/en/film307205.html"},
{"download_latency": 2.189436435699463, "download_timeout": 180.0, "director": "Buster Keaton", "synopsis": "Johnny Gray is the engineer for the Western and Atlantic Flyer, and his engine is named \"The General.\" There are two loves in Johnny's life, \"The General\" and Annabelle Lee. During a visit to Annabelle's home, her brother comes in and announces that Fort Sumter has been fired upon, and, immediately, he and Annabelle's father go to enlist in the Southern cause. Johnny does, too, but he is rejected because \"he is more valuable to the South as an engineer.\" Due to a misunderstanding, Annabelle's father and brother think Johnny refused to sign up. After being told of his supposed cowardice, Annabelle informs Johnny that she will not speak to him again until he is in uniform. A year later, a group of Union soldiers led by Captain Anderson steal Johnny's train with Annabelle in one of the boxcars. Johnny gives chase in another train with all sorts of mishaps and comicals events happening along the way. Deep into Union territory, the Yankee soldiers realize Johnny is alone on the train. Johnny deserts the train and flees into the woods.", "download_slot": "www.filmaffinity.com", "mark": "8.3", "depth": 2, "country": "United States", "title": "The General", "duration": "74 min.", "cast": "Buster Keaton Marion Mack Glen Cavender Jim Farley Frederick Vroom Charles Smith Frank Varnes Joe Keaton Mike Donlin Tom Nawm", "genre": "Comedy Action", "year": "1926", "url": "https://www.filmaffinity.com/en/film228751.html"},
{"download_latency": 1.3699285984039307, "download_timeout": 180.0, "director": "Ingmar Bergman", "synopsis": "A nurse is put in charge of an actress who can't talk and finds that the actress's persona is melding with hers.", "download_slot": "www.filmaffinity.com", "mark": "8.2", "depth": 3, "country": "Sweden", "title": "Persona", "duration": "81 min.", "cast": "Liv Ullmann Bibi Andersson Margaretha Krook Gunnar Björnstrand Jörgen Lindström", "genre": "Drama Mystery", "year": "1966", "url": "https://www.filmaffinity.com/en/film878836.html"},
{"download_latency": 2.1931960582733154, "download_timeout": 180.0, "director": "H.G. Clouzot", "synopsis": "In a wretched South American oil town, four desperate men sign on for a suicide mission to drive trucks loaded with nitroglycerin over a treacherous mountain route. As they ferry their explosive cargo to a faraway oil fire, each bump and jolt tests their courage, their friendship, and their nerves.", "download_slot": "www.filmaffinity.com", "mark": "8.2", "depth": 3, "country": "France", "title": "The Wages of Fear ", "duration": "140 min.", "cast": "Yves Montand Charles Vanel Véra Clouzot Peter van Eyck Folco Lulli William Tubbs Dario Moreno Jo Dest", "genre": "Adventure Thriller Drama", "year": "1953", "url": "https://www.filmaffinity.com/en/film463225.html"},
{"download_latency": 0.6106603145599365, "download_timeout": 180.0, "director": "Sergio Leone", "synopsis": "Morton (Gabriele Ferzetti), the power-hungry owner of a railroad company, hires Frank (Henry Fonda), a gunfighter without a conscience, to kill anyone who stands in the way of the completion of the railroad. After Frank murders land owner Brett McBain (Frank Wolff), McBain's widow (Claudia Cardinale) hires two killers of her own to protect her and gain revenge: a mysterious, harmonica-playing desperado (Charles Bronson) and his rogue sidekick (Jason Robards).", "download_slot": "www.filmaffinity.com", "mark": "8.2", "depth": 3, "country": "Italy", "title": "Once Upon a Time in the West", "duration": "165 min.", "cast": "Claudia Cardinale Charles Bronson Henry Fonda Gabriele Ferzetti Frank Wolff Al Mulock Jason Robards Woody Strode Jack Elam Lionel Stander Paolo Stoppa Keenan Wynn Aldo Sambrell Robert Hossein", "genre": "Western", "year": "1968", "url": "https://www.filmaffinity.com/en/film100958.html"},
{"download_latency": 0.6089868545532227, "download_timeout": 180.0, "director": "Roberto Rossellini", "synopsis": "Based on real events, it tells the story of several Italian Resistance fighters battling fascism in Nazi-occupied Rome. When Gestapo agents raid an apartment where Manfredi (Marcello Pagliero), a prominent member of the underground, is hiding, they arrest the young man who gave him refuge. Manfredi manages to escape, then enlists the help of a parish priest, Don Pietro (Aldo Fabrizi), to make a clandestine delivery to other members of the movement.", "download_slot": "www.filmaffinity.com", "mark": "8.2", "depth": 3, "country": "Italy", "title": "Rome, Open City ", "duration": "100 min.", "cast": "Aldo Fabrizi Anna Magnani Marcello Pagliero Maria Michi Harry Feist Vito Annichiarico Francesco Grandjacquet Giovanna Galletti Carla Rovere", "genre": "Drama War", "year": "1945", "url": "https://www.filmaffinity.com/en/film625556.html"},
{"download_latency": 0.6076977252960205, "download_timeout": 180.0, "director": "Satyajit Ray", "synopsis": "The second chapter in director Satyajit Ray's Apu Trilogy ('Pather Panchali', 'Aparajito', 'The World of Apu'). Following Apu and his family to the city, Ray explores the crowded streets and busy waterfront, introducing us to a gallery of unforgettable images and characters. But when tragedy strikes Apu's family, the boy becomes a man and must choose between the life his father chose -- a life of duty and disappointment -- or a life of his own.", "download_slot": "www.filmaffinity.com", "mark": "8.2", "depth": 3, "country": "India", "title": "Aparajito (The Unvanquished)", "duration": "105 min.", "cast": "Kanu Bannerjee Karuna Bannerjee Pinaki Sengupta Smaran Ghosal Santi Gupta Ramani Sengupta Ranibala Sudipta Roy", "genre": "Drama", "year": "1956", "url": "https://www.filmaffinity.com/en/film936437.html"},
{"download_latency": 0.25594329833984375, "download_timeout": 180.0, "director": "Masaki Kobayashi", "synopsis": "In 1725, during a peaceful period in Japan, Isaburo, a veteran samurai, lives placidly with his wife and his son. One day, his honor and moral principles will be at odds with his clan's. The conflict is inevitable and it will bring unexpected consequences.", "download_slot": "www.filmaffinity.com", "mark": "8.2", "depth": 3, "country": "Japan", "title": "Samurai Rebellion", "duration": "128 min.", "cast": "Toshirô Mifune Yôko Tsukasa Gô Katô Tatsuya Nakadai Etsuko Ichihara Isao Yamagata Tatsuyoshi Ehara Shigeru Kôyama Tatsuo Matsumura Michiko Ôtsuka", "genre": "Drama", "year": "1967", "url": "https://www.filmaffinity.com/en/film451092.html"},
{"download_latency": 0.23753881454467773, "download_timeout": 180.0, "director": "Federico Fellini", "synopsis": "Gelsomina is sold by her very poor mother to Zampanò, an itinerant strongman. She follows him on the road (\"la strada\") and helps him during his shows. Zampanò ill-treats her. She meets \"The Fool\", a funambulist. She feels like going with him, but he puts confusion in her mind by pointing out that perhaps Zampanò is in fact in love with her ...", "download_slot": "www.filmaffinity.com", "mark": "8.2", "depth": 3, "country": "Italy", "title": "La Strada", "duration": "103 min.", "cast": "Anthony Quinn Giulietta Masina Richard Basehart Aldo Silvani Marcella Rovere Livia Venturini", "genre": "Drama", "year": "1954", "url": "https://www.filmaffinity.com/en/film921210.html"},
{"download_latency": 0.22788786888122559, "download_timeout": 180.0, "director": "Bernardo Bertolucci", "synopsis": "In 1901, in the north of Italy, the same day Giuseppe Verdi died, the sons of a landlord and a farm worker are born. They will be inseparable friends, although his relationship will be pushed to its limits due to their different opinions about fascism.", "download_slot": "www.filmaffinity.com", "mark": "8.2", "depth": 3, "country": "Italy", "title": "1900 (Novecento)", "duration": "314 min.", "cast": "Gérard Depardieu Robert De Niro Dominique Sanda Stefania Sandrelli Donald Sutherland Burt Lancaster Sterling Hayden Francesca Bertini Laura Betti Werner Bruhns Stefania Casini Anna Henkel Ellen Schwiers Alida Valli Romolo Valli", "genre": "Drama", "year": "1976", "url": "https://www.filmaffinity.com/en/film903598.html"},
{"download_latency": 0.24342060089111328, "download_timeout": 180.0, "director": "F.W. Murnau", "synopsis": "It tells the story of an elderly hotel doorman whose world crumbles when he is demoted to lavatory attendant. He is embarrassed by his new position so he tries to hide it, although his life keeps disintegrating anyway.", "download_slot": "www.filmaffinity.com", "mark": "8.2", "depth": 3, "country": "Germany", "title": "The Last Laugh", "duration": "90 min.", "cast": "Emil Jannings Maly Delschaft Max Hiller Emilie Kurz Hans Unterkircher Olaf Storm Hermann Vallentin Georg John Emmy Wyda", "genre": "Drama", "year": "1924", "url": "https://www.filmaffinity.com/en/film559192.html"},
{"download_latency": 0.3027384281158447, "download_timeout": 180.0, "director": "Joseph L. Mankiewicz", "synopsis": "Andrew Wyke (Laurence Olivier) is a famous writer of crime novels. Moreover, his passion for puzzles and riddles has led him to transform his mansion into a museum where bizarre toys and mechanisms are exposed. One evening, Milo Tindle (Michael Caine), his wife's lover and owner of several beauty salons, visits him and proposes a clever plan that can be beneficial for the two of them.", "download_slot": "www.filmaffinity.com", "mark": "8.2", "depth": 3, "country": "United Kingdom", "title": "Sleuth", "duration": "138 min.", "cast": "Laurence Olivier Michael Caine Alec Cawthorne John Matthews Eve Channing Teddy Martin", "genre": "Mystery", "year": "1972", "url": "https://www.filmaffinity.com/en/film669546.html"},
{"download_latency": 0.2538461685180664, "download_timeout": 180.0, "director": "Tod Browning", "synopsis": "The story involves duplicitous trapeze artist Cleopatra (Olga Baclanova) seducing sideshow midget Hans (Earles) for his inheritance. Hans’ reluctant friends, the other sideshow attractions, resist allowing her into their clan, until Hans maintains her love is genuine.", "download_slot": "www.filmaffinity.com", "mark": "8.2", "depth": 3, "country": "United States", "title": "Freaks ", "duration": "64 min.", "cast": "Wallace Ford Leila Hyams Olga Baclanova Roscoe Ates Henry Victor Harry Earles Daisy Earles Rose Dione Daisy Hilton Violet Hilton Schlitze Josephine Joseph Johnny Eck Frances O'Connor Peter Robinson Olga Roderick Angelo Rossitto", "genre": "Drama Horror", "year": "1932", "url": "https://www.filmaffinity.com/en/film970488.html"},
{"download_latency": 1.5543975830078125, "download_timeout": 180.0, "director": "Jonathan Demme", "synopsis": "Clarice Starling (Jodie Foster), a young and ambitious FBI agent, enlists the aid of criminally insane ex-psychiatrist Dr. Hannibal Lecter (Anthony Hopkins) to help track down a vicious serial killer named \"Buffalo Bill\" who skins his victims and who has kidnapped a girl, the only daughter of a republican senator.", "download_slot": "www.filmaffinity.com", "mark": "8.2", "depth": 3, "country": "United States", "title": "The Silence of the Lambs", "duration": "115 min.", "cast": "Jodie Foster Anthony Hopkins Scott Glenn Ted Levine Anthony Heald Diane Baker Brooke Smith Tracey Walter Kasi Lemmons Chris Isaak Charles Napier Roger Corman Frankie Faison Paul Lazar Daniel Von Bargen Cynthia Ettinger", "genre": "Thriller Mystery", "year": "1991", "url": "https://www.filmaffinity.com/en/film768790.html"},
{"download_latency": 1.555572271347046, "download_timeout": 180.0, "director": "Luchino Visconti", "synopsis": "It is the story of a poor family torn apart by lust and greed. Rocco (Alain Delon), a soft-spoken, idealistic young man who must deal with turmoil and competition when he and his three brothers set out to Milan in an attempt to improve their lives. There they find Vincenzo, the eldest brother, who works as a construction worker.", "download_slot": "www.filmaffinity.com", "mark": "8.2", "depth": 3, "country": "Italy", "title": "Rocco and His Brothers ", "duration": "170 min.", "cast": "Alain Delon Renato Salvatori Annie Girardot Katina Paxinou Claudia Cardinale Spiros Focás Max Cartier Rocco Vidolazzi Roger Hanin Paolo Stoppa Suzy Delair Claudia Mori Adriana Asti", "genre": "Drama", "year": "1960", "url": "https://www.filmaffinity.com/en/film927129.html"},
{"download_latency": 1.5545132160186768, "download_timeout": 180.0, "director": "Billy Wilder", "synopsis": "Comedy about Coca-Cola's man in West Berlin, who may be fired if he can't keep his American boss's daughter from marrying a Communist.", "download_slot": "www.filmaffinity.com", "mark": "8.2", "depth": 3, "country": "United States", "title": "One, Two, Three", "duration": "108 min.", "cast": "James Cagney Pamela Tiffin Horst Buchholz Arlene Francis Liselotte Pulver Howard St. John Hanns Lothar Leon Askin Ralf Walter Karl Lieffen Hubert von Meyernick Red Buttons", "genre": "Comedy", "year": "1961", "url": "https://www.filmaffinity.com/en/film459265.html"},
{"download_latency": 1.785444736480713, "download_timeout": 180.0, "director": "Robert Bresson", "synopsis": "April 1943, during WWII. Fontaine, a 27 years old young man who is a member of the French Resistance fighting against the nazis, is arrested by the Gestapo in order to be interrogated. Fontaine suspects that he will be executed, so he begins to plan his escape.", "download_slot": "www.filmaffinity.com", "mark": "8.2", "depth": 3, "country": "France", "title": "A Man Escaped ", "duration": "99 min.", "cast": "François Leterrier Roland Monod Charles Le Clainche Maurice Beerblock Jacques Ertaud", "genre": "Drama", "year": "1956", "url": "https://www.filmaffinity.com/en/film584476.html"},
{"download_latency": 1.8216543197631836, "download_timeout": 180.0, "director": "Stanley Kubrick", "synopsis": "United Kingdom. In an undetermined future, Alex (Malcolm McDowell) is the leader of a gang of «droogs» who walks the streets of London cultivating his sole two passions: ultraviolence and Beethoven's music. He and his young followers vent their most violent instincts on any person crossing their path. They beat, rape and terrorize their victims. When their escalation of terror culminates in murder, Alex is arrested and sent to prison. There he volunteers for an ground-breaking re-education experiment aimed at drastically eliminating in convicts the slightest trace of an antisocial conduct.", "download_slot": "www.filmaffinity.com", "mark": "8.2", "depth": 3, "country": "United Kingdom", "title": "A Clockwork Orange", "duration": "137 min.", "cast": "Malcolm McDowell Patrick Magee Michael Bates Adrienne Corri Warren Clarke John Clive Aubrey Morris Carl Duering Paul Farrell Clive Francis Michael Gover Miriam Karlin James Marcus Geoffrey Quigley Sheila Raynor Madge Ryan Philip Stone David Prowse", "genre": "Drama", "year": "1971", "url": "https://www.filmaffinity.com/en/film745383.html"},
{"download_latency": 2.868973970413208, "download_timeout": 180.0, "director": "Federico Fellini", "synopsis": "Cabiria is a wide-eyed waif, a streetwalker living in a poor section of Rome where she owns her little house, has a bank account, and dreams of a miracle. We follow her nights (and days): a boyfriend steals 40,000 lire from her and nearly drowns her, a movie star on the Via Veneto takes her home with him, at a local shrine she seeks the Madonna's intercession, then she meets an accountant who's seen her, hypnotized on a vaudeville stage, acting out her heart's longings. He courts her. Is it fate that led to their meeting? Is this finally a man who appreciates her for who she is?", "download_slot": "www.filmaffinity.com", "mark": "8.2", "depth": 3, "country": "Italy", "title": "Nights of Cabiria", "duration": "110 min.", "cast": "Giulietta Masina François Périer Amedeo Nazzari Aldo Silvani Franca Marzi Ennio Girolami Mario Passante Dorian Gray Franco Fabrizi", "genre": "Drama", "year": "1957", "url": "https://www.filmaffinity.com/en/film393658.html"},
{"download_latency": 2.892939567565918, "download_timeout": 180.0, "director": "Satyajit Ray", "synopsis": "Forced to abandon his education, Apu´s prospects look bleak until fate intervenes in the form of an insane bridegroom. To save the abandoned bride from public disgrace, Apu marries her, beginning a new life as husband and father. Third and last part of the Apu trilogy.", "download_slot": "www.filmaffinity.com", "mark": "8.2", "depth": 3, "country": "India", "title": "The World of Apu", "duration": "117 min.", "cast": "Soumitra Chatterjee Sharmila Tagore Alok Chakravarty Swapan Mukherjee Dhiresh Majumdar Sefalika Devi Dhiren Ghosh", "genre": "Drama", "year": "1959", "url": "https://www.filmaffinity.com/en/film859753.html"},
{"download_latency": 2.916843891143799, "download_timeout": 180.0, "director": "Satyajit Ray", "synopsis": "Tells the story of a Bengali family driven by bad fortune. The father, Harihara, is a secular clerk, healer, dreamer and poet. Sabajaya, the mother, works to feed the family and receives with hope and joy the new birth of Apu. First film of the Apu trilogy.", "download_slot": "www.filmaffinity.com", "mark": "8.2", "depth": 3, "country": "India", "title": "Pather Panchali", "duration": "115 min.", "cast": "Kanu Bannerjee Karuna Bannerjee Uma Das Gupta Subir Bannerjee Chunibala Devi", "genre": "Drama", "year": "1955", "url": "https://www.filmaffinity.com/en/film592587.html"},
{"download_latency": 1.5014822483062744, "download_timeout": 180.0, "director": "Alfred Hitchcock", "synopsis": "A professional photographer, L.B. \"Jeff\" Jeffries (Stewart), is obliged to stay at home because he broke a leg. Despite the company of his girlfriend (Kelly) and his nurse (Ritter), he tries to escape from boredom by looking through the window of his apartment using goggles. After a while, he starts to suspect that there has been a murder in one of the opposite apartments.", "download_slot": "www.filmaffinity.com", "mark": "8.2", "depth": 3, "country": "United States", "title": "Rear Window", "duration": "110 min.", "cast": "James Stewart Grace Kelly Thelma Ritter Raymond Burr Judith Evelyn Wendell Corey", "genre": "Mystery", "year": "1954", "url": "https://www.filmaffinity.com/en/film802694.html"},
{"download_latency": 1.863924503326416, "download_timeout": 180.0, "director": "Orson Welles", "synopsis": "An unseen man sets the timer on an explosive device. The clock starts ticking down as soon as he stashes it in the boot of a fancy-looking car. Immediately afterwards, a well-heeled businessman motors off with his cheap-looking girlfriend. Through the tawdry streets they roll, until they pass by Mexican lawman Ramon \"Mike\" Vargas (Charlton Heston) and his new wife Susan (Janet Leigh). As the newly-weds cross over the border, into the US, they catch up and overtake the automobile. Just a few steps more and the car explodes in a ball of flame, casting harsh shadows. Unfortunately this is an international incident since the bomb was set in Mexico and detonated in America.", "download_slot": "www.filmaffinity.com", "mark": "8.2", "depth": 3, "country": "United States", "title": "Touch of Evil", "duration": "108 min.", "cast": "Charlton Heston Janet Leigh Orson Welles Marlene Dietrich Joseph Calleia Akim Tamiroff Dennis Weaver Ray Collins Mercedes McCambridge Joseph Cotten Zsa Zsa Gabor", "genre": "Film noir Mystery", "year": "1958", "url": "https://www.filmaffinity.com/en/film127610.html"},
{"download_latency": 1.8948614597320557, "download_timeout": 180.0, "director": "Brian De Palma", "synopsis": "Al Pacino stars as Tony Montana, whose intelligence, guts, and ambition help him skyrocket from dishwasher to the top of a criminal empire but whose eventual paranoia and incestuous desire for his kid sister (Mary Elizabeth Mastrantonio) prove his undoing. Michelle Pfeiffer plays Tonys neglected coke-addicted trophy wife, and Steven Bauer is his concerned friend. F. Murray Abraham, Robert Loggia, and Paul Shenar are some of Tonys sleazy business partners and potential killers.", "download_slot": "www.filmaffinity.com", "mark": "8.2", "depth": 3, "country": "United States", "title": "Scarface", "duration": "163 min.", "cast": "Al Pacino Steven Bauer Michelle Pfeiffer Mary Elizabeth Mastrantonio Robert Loggia Miriam Colon F. Murray Abraham Paul Shenar Harris Yulin Dennis Holahan Mark Margolis", "genre": "Drama", "year": "1983", "url": "https://www.filmaffinity.com/en/film188896.html"},
{"download_latency": 0.521143913269043, "download_timeout": 180.0, "director": "Francis Ford Coppola", "synopsis": "During the Vietnam War, the young American Captain Willard is given the assignment to hunt down and kill one of his own: Colonel Kurtz who has apparently gone insane, murdered hundreds of innocent people, and constructed a strange kingdom for himself deep in the jungle. Willard and his crew embark on a surreal river journey to find Kurtz, meeting along the way a Lieutenant-Colonel who surfs during live combat, Playboy bunnies dropped in by helicopter to entertain rowdy troops, and the inhabitants of a French plantation trapped in colonial times. ", "download_slot": "www.filmaffinity.com", "mark": "8.2", "depth": 3, "country": "United States", "title": "Apocalypse Now", "duration": "153 min.", "cast": "Martin Sheen Marlon Brando Robert Duvall Frederic Forrest Sam Bottoms Albert Hall Laurence Fishburne Harrison Ford Dennis Hopper G.D. Spradlin Christian Marquand Aurore Clément Cynthia Wood Colleen Camp Damien Leake James Keane Herb Rice Scott Glenn R. Lee Ermey", "genre": "War Drama", "year": "1979", "url": "https://www.filmaffinity.com/en/film701892.html"},
{"download_latency": 1.8995673656463623, "download_timeout": 180.0, "director": "Fritz Lang", "synopsis": "In Metropolis, society is divided in two classes: the rich, who have all the power and all kinds of luxuries and the workers, doomed to work and confined to live in poor conditions. One day, Freder (Alfred Abel), the son of the powerful Joh Fredersen (Gustav Frohlich), the man who is in charge of the whole city, after falling in love with Maria (Brigitte Helm), discovers the hard conditions in which the workers live and warns his father about a possible rebellion.", "download_slot": "www.filmaffinity.com", "mark": "8.2", "depth": 3, "country": "Germany", "title": "Metropolis ", "duration": "153 min.", "cast": "Gustav Fröhlich Brigitte Helm Alfred Abel Rudolf Klein-Rogge Fritz Rasp Theodor Loos Heinrich George Fritz Alberti Grete Berger Heinrich Gotho Georg John Olaf Storm", "genre": "Sci-Fi Drama", "year": "1927", "url": "https://www.filmaffinity.com/en/film282386.html"},
{"download_latency": 1.8988654613494873, "download_timeout": 180.0, "director": "Clint Eastwood", "synopsis": "Little Bill Daggett (Gene Hackman), a sadistic, dictatorial sheriff, enforces gun control on a tiny frontier town, doling out his own brand of due process as he sees fit. When he denies justice to the prostitutes of the town brothel, one of whom has been slashed by a client, the women hire Bill Munny (Eastwood), a reformed gunslinger, to gain vengeance. However, Munny must contend with his new moral code in the face of revisiting the life he left behind.", "download_slot": "www.filmaffinity.com", "mark": "8.2", "depth": 3, "country": "United States", "title": "Unforgiven", "duration": "126 min.", "cast": "Clint Eastwood Gene Hackman Morgan Freeman Richard Harris Jaimz Woolvett Saul Rubinek Frances Fisher Anna Thomson Anthony James", "genre": "Western Drama", "year": "1992", "url": "https://www.filmaffinity.com/en/film262344.html"},
{"download_latency": 0.572939395904541, "download_timeout": 180.0, "director": "Robert Aldrich", "synopsis": "In a decaying Hollywood mansion, Jane Hudson, a former child star, and her sister Blanche, a movie queen forced into retirement after a crippling accident, live in virtual isolation.", "download_slot": "www.filmaffinity.com", "mark": "8.2", "depth": 3, "country": "United States", "title": "What Ever Happened to Baby Jane? ", "duration": "133 min.", "cast": "Bette Davis Joan Crawford Victor Buono Wesley Addy Julie Allred Anne Barton Marjorie Bennett Bert Freed Anna Lee Maidie Norman Dave Willock William Aldrich Russ Conway Maxine Cooper Robert Cornthwaite Michael Fox Gina Gillespie Barbara Merrill Don Ross", "genre": "Drama", "year": "1962", "url": "https://www.filmaffinity.com/en/film167314.html"},
{"download_latency": 0.5153992176055908, "download_timeout": 180.0, "director": "Alfonso Cuarón", "synopsis": "\"Roma\" follows Cleo (Yalitza Aparicio), a young domestic worker for a family in the middle-class neighborhood of Roma in Mexico City. Delivering an artful love letter to the women who raised him, Cuarón draws on his own childhood to create a vivid and emotional portrait of domestic strife and social hierarchy amidst political turmoil of the 1970s.", "download_slot": "www.filmaffinity.com", "mark": "8.3", "depth": 3, "country": "Mexico", "title": "Roma ", "duration": "135 min.", "cast": "Yalitza Aparicio Marina de Tavira Marco Graf Daniela Demesa Latin Lover Enoc Leaño Clementina Guadarrama", "genre": "Drama", "year": "2018", "url": "https://www.filmaffinity.com/en/film850453.html"},
{"download_latency": 0.33157968521118164, "download_timeout": 180.0, "director": "Carl Theodor Dreyer", "synopsis": "Year 1431. Young french Joan of Arc is put on trial for alleged treason. Once glorified as her nation’s saviour, she has become a mere pawn in a game of political intrigue. Her sacrifice would appear inevitable...", "download_slot": "www.filmaffinity.com", "mark": "8.3", "depth": 2, "country": "France", "title": "The Passion of Joan of Arc ", "duration": "110 min.", "cast": "Maria Falconetti Eugene Silvain Maurice Schutz Michel Simon Antonin Artaud André Berley", "genre": "Drama", "year": "1928", "url": "https://www.filmaffinity.com/en/film780465.html"},
{"download_latency": 0.2730138301849365, "download_timeout": 180.0, "director": "Akira Kurosawa", "synopsis": "Kanji Watanabe has served in a monotonous bureaucratic position in City Hall for 30 years, providing for a son who only seems to care about his money. He is seemingly content with this barely living routine, until a trip to the doctor reveals that he is dying of stomach cancer. Suddenly awakened to the meaninglessness of his life so far, Watanabe searches in vain for a way to give his life purpose.", "download_slot": "www.filmaffinity.com", "mark": "8.3", "depth": 2, "country": "Japan", "title": "To Live", "duration": "143 min.", "cast": "Takashi Shimura Nobuo Kaneko Kyôko Seki Makoto Kobori Kumeko Urabe Yoshie Minami Miki Odagiri Kamatari Fujiwara", "genre": "Drama", "year": "1952", "url": "https://www.filmaffinity.com/en/film246184.html"},
{"download_latency": 0.2720944881439209, "download_timeout": 180.0, "director": "Robert Mulligan", "synopsis": "The lawyer Atticus Finch (Gregory Peck), decides to defend a black man (Brock Peters) undeservedly charged with raping a poor white woman. The bigoted townspeople would rather lynch the accused than try him, and they make life hell for the lawyer, his daughter, Scout (Mary Badham) and his son Jem (Philip Alford). While Atticus tries the case, his inquisitive children learn a hard and unforgettable lesson in justice, morality, and prejudice, part of which requires overcoming their fear of their mysterious neighbor Boo Radley (Robert Duvall).", "download_slot": "www.filmaffinity.com", "mark": "8.3", "depth": 2, "country": "United States", "title": "To Kill a Mockingbird ", "duration": "129 min.", "cast": "Gregory Peck Mary Badham Brock Peters Phillip Alford John Megna Frank Overton Rosemary Murphy Robert Duvall", "genre": "Drama", "year": "1962", "url": "https://www.filmaffinity.com/en/film513636.html"},
{"download_latency": 0.4477827548980713, "download_timeout": 180.0, "director": "Vittorio De Sica", "synopsis": "After nearly two years of unemployment, Antonio (Lamberto Maggiorani) finally finds work posting bills. But he needs a bicycle to do the job. Unfortunately, he was forced to pawn his own bicycle long ago, so Antonio has to exchange his family's linen for his bicycle. But when the bike is stolen on his first day of work, he must comb the streets of Rome in search of the bike: his family's only means to survival.", "download_slot": "www.filmaffinity.com", "mark": "8.3", "depth": 2, "country": "Italy", "title": "Bicycle Thieves", "duration": "93 min.", "cast": "Lamberto Maggiorani Enzo Staiola Lianella Carell Gino Saltamerenda Vittorio Antonucci Giulio Chiari Fausto Guerzoni Elena Altieri", "genre": "Drama", "year": "1948", "url": "https://www.filmaffinity.com/en/film602757.html"},
{"download_latency": 0.5449972152709961, "download_timeout": 180.0, "director": "Carl Theodor Dreyer", "synopsis": "In a conservative, super-pious Danish town, the widower Morten Borgen -- the father of three boys -- cuts against the grain of the community with his constant heretical doubt. One of his sons, Mikkel Borgen, is entangled in an interfaith romance with a fundamentalist's daughter, while the second, Anders Borgen, is an agnostic, and the third, Johannes Borgen believes that he actually is Jesus Christ -- a conviction ridiculed by almost everyone as pure insanity.", "download_slot": "www.filmaffinity.com", "mark": "8.3", "depth": 3, "country": "Denmark", "title": "Ordet (The Word)", "duration": "125 min.", "cast": "Henrik Malberg Emil Hass Christensen Preben Lerdorff Rye Cay Kristiansen Brigitte Federspiel Ann Elizabeth Ejner Federspiel Sylvia Eckhausen", "genre": "Drama", "year": "1955", "url": "https://www.filmaffinity.com/en/film489524.html"},
{"download_latency": 0.5274178981781006, "download_timeout": 180.0, "director": "Sam Wood", "synopsis": "Moved by a strange sense of business, Groucho gets all the stars of the Milano Opera on a boat headed to New York. Two stowaways also travel on the same boat: Harpo and Chico. The three of them stir up the boat, create a scandal in New York and turn the release day into a madness the opera world will never forget.", "download_slot": "www.filmaffinity.com", "mark": "8.3", "depth": 2, "country": "United States", "title": "A Night at the Opera ", "duration": "94 min.", "cast": "The Marx Brothers (spanish: Los Hermanos Marx) Groucho Marx Harpo Marx Chico Marx Margaret Dumont Kitty Carlisle Allan Jones Sig Ruman Walter Woolf King Edward Keane Robert Emmet O'Connor Lorraine Bridges", "genre": "Comedy", "year": "1935", "url": "https://www.filmaffinity.com/en/film514584.html"},
{"download_latency": 0.5176057815551758, "download_timeout": 180.0, "director": "John Ford", "synopsis": "When Tom Joad (Henry Fonda) returns home after being released from prison, he discovers his family has been kicked out of their farm. Seeking a better future, he leaves with his mother (Jane Darwell) and the rest of the family to California. However, their journey is far from easy, and there is no guarantee the promised land will provide the life they are hoping for.", "download_slot": "www.filmaffinity.com", "mark": "8.3", "depth": 2, "country": "United States", "title": "The Grapes of Wrath", "duration": "129 min.", "cast": "Henry Fonda Jane Darwell John Carradine Charley Grapewin Dorris Bowdon Russell Simpson John Qualen O.Z. Whitehead Eddie Quillan Zeffie Tilbury Ward Bond", "genre": "Drama", "year": "1940", "url": "https://www.filmaffinity.com/en/film940315.html"},
{"download_latency": 0.5378925800323486, "download_timeout": 180.0, "director": "Billy Wilder", "synopsis": "Two men (Lemmon and Curtis) hide from the mafia in an all girls band after they witness a murder, and find it hard to keep their cover as women when they meet Sugar Kane (Marilyn).", "download_slot": "www.filmaffinity.com", "mark": "8.3", "depth": 2, "country": "United States", "title": "Some Like It Hot ", "duration": "120 min.", "cast": "Marilyn Monroe Jack Lemmon Tony Curtis George Raft Pat O'Brien Nehemiah Persoff Joe E. Brown Joan Shawlee Billy Gray George E. Stone Mike Mazurki Dave Barry Harry Wilson Beverly Wills Edward G. Robinson Jr. Barbara Drew", "genre": "Comedy", "year": "1959", "url": "https://www.filmaffinity.com/en/film353180.html"},
{"download_latency": 1.3622736930847168, "download_timeout": 180.0, "director": "Fritz Lang", "synopsis": "In Fritz Langs startling and exquisite film M, fear stalks the streets of Berlin in the form of a serial child murderer whose grisly accomplishments are so heinous even the criminal minds of the underworld want him dead. Filmed in post-Weimar Germany during the infancy of the Nazi state, this tale of moral depravity serves not just as an allegory for the need of justice for all, but as an ominous foreshadowing of the sort of societal hysteria that leads to cultural witch hunts. Originally titled \"Mörder Unter Uns\" (\"Murder Among Us\"), M was one of Peter Lorre's (CASABLANCA) first major film roles. Langs expressionistic eye plunges into the dark cityscape of Berlin, as he follows the killer whistling down the street, seducing small children with toys and candy, and eventually fleeing for his life. A city paralysed by fear, and a vast criminal underground network of blind beggars, thieves and murderers, as well as an unforgettable climax notable for its startling statement about the murderous nature which resides within human beings, are all rendered in Lang’s painterly cinematography of sharp angles, dark corners and breakneck pacing.", "download_slot": "www.filmaffinity.com", "mark": "8.3", "depth": 2, "country": "Germany", "title": "M ", "duration": "111 min.", "cast": "Peter Lorre Otto Wernicke Gustav Gründgens Theo Lingen Theodor Loos Georg John Ellen Widman Inge Landgut", "genre": "Thriller Mystery", "year": "1931", "url": "https://www.filmaffinity.com/en/film875960.html"},
{"download_latency": 1.3550269603729248, "download_timeout": 180.0, "director": "Sergio Leone", "synopsis": "Ex-gangster David Aaronson (Robert DeNiro) is drawn back to New York City after years of being in hiding, despite his vow to never return after the deaths of his friends in the lower East Side. David reflects back on his life, spanning five decades of major American revolutions starting in the 1920s, when he first began his career in organized crime. As David pieces together his past he discovers new truths about his friends' deaths.", "download_slot": "www.filmaffinity.com", "mark": "8.3", "depth": 2, "country": "United States", "title": "Once Upon a Time in America", "duration": "225 min.", "cast": "Robert De Niro James Woods Elizabeth McGovern Tuesday Weld William Forsythe Treat Williams Jennifer Connelly Burt Young Joe Pesci Danny Aiello Clem Caserta James Russo Mario Brega Brian Bloom Chuck Low James Hayden Larry Rapp Richard Bright Rusty Jacobs Scott Schutzman Tiler", "genre": "Drama", "year": "1984", "url": "https://www.filmaffinity.com/en/film421564.html"},
{"download_latency": 1.3473780155181885, "download_timeout": 180.0, "director": "Giuseppe Tornatore", "synopsis": "A young boy named Salvatore in a small Italian village is overjoyed when the local movie projectionist (Philippe Noiret) reveals to him the mysteries of moviemaking, beginning his lifelong love affair with cinema.", "download_slot": "www.filmaffinity.com", "mark": "8.3", "depth": 2, "country": "Italy", "title": "Cinema Paradiso", "duration": "155 min.", "cast": "Philippe Noiret Jacques Perrin Salvatore Cascio Agnese Nano Brigitte Fossey Marco Leonardi Antonella Attiu Enzo Cannavale Isa Danieli Leo Gullotta Pupella Maggio Leopoldo Trieste", "genre": "Drama", "year": "1988", "url": "https://www.filmaffinity.com/en/film420972.html"},
{"download_latency": 3.448674440383911, "download_timeout": 180.0, "director": "John Ford", "synopsis": "Congressman Ransom Stoddard (James Stewart) returns with his wife Hallie (Vera Miles) to the tiny town of Shinbone to bury an old friend, Tom Doniphon (John Wayne), and tells reporters the truth about how he came to be known as 'the man who shot Liberty Valance.' Many years before, as a dishwasher and aspiring lawyer, Ransom had encouraged Shinbone to stand up against the highwayman Valance (Lee Marvin), a thug who also enforced the will of cattle interests trying to block statehood for the territory. Ransom also attracted the affection of Hallie Ericson, much to the ire of local stalwart Tom Doniphon, whose jealous rage was more dangerous to Ransom than the wrath of Valance and his scum henchmen. But things turned out in rather an ironic way... ", "download_slot": "www.filmaffinity.com", "mark": "8.3", "depth": 2, "country": "United States", "title": "The Man Who Shot Liberty Valance", "duration": "119 min.", "cast": "John Wayne James Stewart Vera Miles Lee Marvin Edmond O'Brien Andy Devine Ken Murray John Carradine Jeanette Nolan John Qualen Willis Bouchey Carleton Young Woody Strode Denver Pyle Strother Martin Lee Van Cleef Robert F. Simon O. Z. Whitehead Paul Birch Joseph Hoover", "genre": "Western", "year": "1962", "url": "https://www.filmaffinity.com/en/film914839.html"},
{"download_latency": 3.4362354278564453, "download_timeout": 180.0, "director": "Luis Buñuel", "synopsis": "El Jaibo is a teenager who escapes from a reformatory institution and joins his friends in the neighborhood. After a couple of days, el Jaibo kills, with the presence of his friend Pedro, the boy who apparently was responsible for his stay in the reformatory. Since then, the fate of Pedro and el Jaibo would be tragically related.", "download_slot": "www.filmaffinity.com", "mark": "8.3", "depth": 2, "country": "Mexico", "title": "The Young and the Damned", "duration": "88 min.", "cast": "Alfonso Mejía Roberto Cobo Estela Inda Miguel Inclán Alma Delia Fuentes Francisco Jambrina", "genre": "Drama", "year": "1950", "url": "https://www.filmaffinity.com/en/film300612.html"},
{"download_latency": 3.801048755645752, "download_timeout": 180.0, "director": "Akira Kurosawa", "synopsis": "It is the story of an elderly guide and Goldi hunter (Maxim Munzuk), who, at the turn of the century, agrees to shepherd a Russian explorer (Yuri Solomin) and a troop of soldiers through the most treacherous passages of the Far East. Two men whose contrasting lives are bound by common thread of survival learn friendship and respect in Siberian wasteland.", "download_slot": "www.filmaffinity.com", "mark": "8.3", "depth": 2, "country": "Soviet Union  (USSR)", "title": "Dersu Uzala", "duration": "141 min.", "cast": "Maksim Munzuk Yuriy Solomin Svetlana Danilchenko Vladimir Kremena Dmitriy Korshikov Suymenkul Chokmorov", "genre": "Adventure Drama", "year": "1975", "url": "https://www.filmaffinity.com/en/film478505.html"}
]